## 2. Pandas
### 2.1 Series

In [1]:
import numpy as np
import pandas as pd

- Series 생성
    - numpy 1차원 배열(value) + index

In [2]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], index=['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [3]:
type(s)

pandas.core.series.Series

In [4]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [9]:
s['서울']

9904312

In [10]:
# index를 별도로 설정하지 않으면, 인덱스는 0, 1, 2, ... 이 된다.
pd.Series(np.arange(11, 15))

0    11
1    12
2    13
3    14
dtype: int32

In [11]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [20]:
s.name = '인구'
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

- 시리즈 연산 - 벡터화 연산이 가능

In [14]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

- 인덱싱

In [17]:
s['서울'], s[0], s.서울

(9904312, 9904312, 9904312)

In [21]:
s['대구'], s[3], s.대구, s[-1]

(2466052, 2466052, 2466052, 2466052)

In [22]:
# 배열 인덱싱 - 결과는 시리즈
s[[0, 1, 3]]

도시
서울    9904312
부산    3448737
대구    2466052
Name: 인구, dtype: int64

In [23]:
s[['서울', '인천']]

도시
서울    9904312
인천    2890451
Name: 인구, dtype: int64

In [24]:
# 인덱스로 조건식
s[(s > 2500000) & (s < 5000000)]    # 250만 초과 500만 미만

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [25]:
s[s % 2 == 0]   # 짝수번째

도시
서울    9904312
대구    2466052
Name: 인구, dtype: int64

- 슬라이싱

In [26]:
# 숫자 인덱스로 하는 슬라이싱은 넘파이와 동일
s[:2]

도시
서울    9904312
부산    3448737
Name: 인구, dtype: int64

In [27]:
# 인덱스 문자열로 슬라이싱을 하는 경우에는 : 뒤 인덱스도 포함
s[:'인천']

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

- 시리즈와 딕셔너리

In [28]:
'서울' in s, '대전' in s

(True, False)

In [29]:
for key, value in s.items():
    print(f'{key}: {value}')

서울: 9904312
부산: 3448737
인천: 2890451
대구: 2466052

In [30]:
d = {"서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 1490158}
s2 = pd.Series(d)
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [35]:
# 인덱스의 순서를 정하고 싶으면, 인덱스를 별도로 설정해야 함
s2 = pd.Series(d, index=['서울', '부산', '인천', '대전'])
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

- 인덱스 기반 연산

In [36]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [40]:
ds.notna(), ds.notnull()

(대구    False
 대전    False
 부산     True
 서울     True
 인천     True
 dtype: bool,
 대구    False
 대전    False
 부산     True
 서울     True
 인천     True
 dtype: bool)

In [41]:
ds[ds.notna()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [45]:
# 증가율(% 단위)
rs = (s - s2) / s2 * 100
rs = rs[rs.notna()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

- 데이터의 갱신, 추가, 삭제

In [46]:
rs['부산'] = 1.64
rs[1] = 2.83
rs.인천 = 9.82
rs

부산    1.64
서울    2.83
인천    9.82
dtype: float64

In [48]:
# rs[3] = '광주' // err

In [49]:
rs['광주'] = 1.51   # ❗추가하는 경우 rs[3], rs.광주 는 사용할 수 없음
rs

부산    1.64
서울    2.83
인천    9.82
광주    1.51
dtype: float64

In [50]:
del rs['부산']      # ❗삭제하는 경우 rs[0], rs.부산은 사용할 수 없음

In [51]:
rs

서울    2.83
인천    9.82
광주    1.51
dtype: float64

- 연습 문제 4.1.1

In [52]:
s1 = pd.Series(np.arange(11, 15), index=['a', 'b', 'c', 'd'])
s2 = pd.Series(np.arange(31, 39 ,2), index=['a', 'b', 'c', 'd'])
print(s1)
print(s2)

a    11
b    12
c    13
d    14
dtype: int32
a    31
b    33
c    35
d    37
dtype: int32

In [53]:
print(s1 + s2, s1 - s2, s1 * s2, s1 / s2)

a    42
b    45
c    48
d    51
dtype: int32 a   -20
b   -21
c   -22
d   -23
dtype: int32 a    341
b    396
c    455
d    518
dtype: int32 a    0.354839
b    0.363636
c    0.371429
d    0.378378
dtype: float64

- 중요한 method

In [54]:
dice = pd.Series(np.random.randint(1, 7, 10))
dice

0    2
1    6
2    4
3    4
4    2
5    5
6    6
7    6
8    5
9    4
dtype: int32

In [55]:
# 요소의 갯수
dice.count(), dice.size, len(dice)

(10, 10, 10)

In [56]:
# 고유한 값
dice.unique(), dice.nunique()

(array([2, 6, 4, 5]), 4)

In [57]:
# 각각의 고유한 값이 몇개씩 있는지
dice.value_counts()

6    3
4    3
2    2
5    2
dtype: int64

In [58]:
np.unique(dice, return_counts=True)

(array([2, 4, 5, 6]), array([2, 3, 2, 3], dtype=int64))

In [60]:
# 기술통계
dice.min(), dice.max(), dice.mean(), dice.median(), dice.std(), dice.var()

(2, 6, 4.4, 4.5, 1.505545305418162, 2.2666666666666666)

In [61]:
# 기술통계 요약
dice.describe()

count    10.000000
mean      4.400000
std       1.505545
min       2.000000
25%       4.000000
50%       4.500000
75%       5.750000
max       6.000000
dtype: float64

In [62]:
# 값의 오름차순 정렬
dice.sort_values()

0    2
4    2
2    4
3    4
9    4
5    5
8    5
1    6
6    6
7    6
dtype: int32

In [63]:
# 값의 내림차순 정렬
dice.sort_values(ascending=False)

1    6
6    6
7    6
5    5
8    5
2    4
3    4
9    4
0    2
4    2
dtype: int32

In [67]:
# 인덱스의 오름차순 정렬
s.sort_index()

도시
대구    2466052
부산    3448737
서울    9904312
인천    2890451
Name: 인구, dtype: int64

In [68]:
# 인덱스의 내림차순 정렬
s.sort_index(ascending=False)

도시
인천    2890451
서울    9904312
부산    3448737
대구    2466052
Name: 인구, dtype: int64

In [69]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [71]:
# inplace=True 옵션을 주면, 원본이 변경됨
s.sort_index(inplace=True)
s

도시
대구    2466052
부산    3448737
서울    9904312
인천    2890451
Name: 인구, dtype: int64

- 결측치(Na, NaN, null) 처리

In [72]:
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [74]:
# 결측치 확인
ds.isna()   # ds.isnull()과 동일

대구     True
대전     True
부산    False
서울    False
인천    False
dtype: bool

In [75]:
# 시리즈 내에 결측치가 있는지 확인
# 정보 수가 너무 많으면 이렇게 수를 파악해야한다.
ds.isna().sum(), s.isna().sum()

(2, 0)

- Titanic data로 확인

In [77]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()      # 앞의 다섯줄 보여주기

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [78]:
survived = titanic['survived']
age = titanic['age']

In [79]:
survived.isna().sum()   # 결과가 0이므로 결측치가 없음

0

In [80]:
age.isna().sum()        # 177개의 결측치가 있음

177

- 결측치 처리 방법
    - 제거
    - 대표값(중앙값, 평균, 최빈값)으로 대체
    - 임의의 값으로 대체

In [81]:
# 제거
ds.dropna(inplace=True)
ds

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [85]:
# 평균으로 대체
age = age.fillna(age.mean()).astype(int)
age.head()

0    22
1    38
2    26
3    35
4    35
Name: age, dtype: int32

In [86]:
embark = titanic.embark_town
embark.value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

In [87]:
embark.isna().sum()

2

In [88]:
embark.fillna('Southampton', inplace=True)
embark.value_counts()

Southampton    646
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64